# Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
# Для n = 6: [2, 2, 2, 2, 2, 3] -> 13

n = int(input())
A = []
s = 0
for i in range(1, n + 1):
    g = round((1 + 1 / i) ** i)
    A.append(g)
    s += g
print(A)
print(s)
